# EA_DataAccSetBool

## Description
Set boolean value to the object, associated to the accessory index.

```pascal
PROCEDURE EA_DataAccSetBool(
				acc        : INTEGER;
				valueIndex : INTEGER;
				value      : BOOLEAN);
```

```python

def vs.EA_DataAccSetBool(acc, valueIndex, value):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|acc|INTEGER||
|valueIndex|INTEGER||
|value|BOOLEAN||

## Version
Availability: from Vectorworks 2016
## Category
* EnergyAnalysis Interface Library